Repository: pypi-data/pypi-mirror-58
Catalog: packages/rt.categorysupport/rt.categorysupport-1.1.0.tar.gz/rt.categorysupport-1.1.0/src/rt/categorysupport/locales/*/LC_MESSAGES/rt.categorysupport.po
Languages: it

source: Adds possibility to add categories to some content
it: Aggiunge la possibilita di aggiungere tassonomie per i contenuti dexterity

source: Installs the rt.categorysupport add-on.
it: Installa il plugin rt.categorysupport.

source: Taxonomies info view
it: Vista Temi

source: Taxonomy Settings
it: Impostazioni Temi

source: Taxonomy support behavior
it: Comportamento supporto temi

source: Uninstalls the rt.categorysupport add-on.
it: Disinstalla il plugin rt.categorysupport.

source: category_list
it: Lista di temi

source: label_filed_under
it: Categorie:

source: label_taxonomies_under
it: Temi:

source: taxonomies
it: Temi

source: taxonomy_settings
it: Impostazioni Temi
